modules/user/models/User.php

SELECT `id`, `username`, `email`, `password_hash`, `auth_key`, `head_img` FROM `gzh_user` WHERE `id`=1
---
    public static function findIdentity($id) {
        return static::find()->select(['id', 'username', 'email', 'password_hash', 'auth_key', 'head_img'])->where(['id' => $id])->one();