modules/module/controllers/AdminController.php

    protected function findModel($id)
    {
    	if (($model = Title::findOne($id)) !== null) {
---
SELECT * FROM `gzh_title` WHERE `id`='13'

    public function actionAdd($id) {

    	$title = Title::findOne($id);
---
SELECT * FROM `gzh_title` WHERE `id`='13'