modules/module/controllers/MenuController.php

    public function actionCreate()
    {
        $model = new Menu();

        if ($model->load(Yii::$app->request->post()) && $model->validate()) {
            $model->sort = time();
            $model->save();
---
INSERT INTO `gzh_menu` (`description`, `menu_url`, `type`, `parent_id`, `status`, `role_type`, `sort`, `create_time`, `update_time`) VALUES ('角色管理', '/rbac/role/index', 1, 13, 1, 1, 1524552168, 1524552168, 1524552168)