modules/module/models/Title.php

SELECT `module_name`, `module_description`, `id`, `parent_id` FROM `gzh_title` ORDER BY `sort` DESC
---
    public static function selectAll(){
        $items = self::find()->select(['module_name','module_description','id','parent_id'])->orderBy(['sort' => SORT_DESC])->indexBy('id')->asArray()->all();

SELECT `t`.`id` AS `title_id`, `t`.`parent_id`, `t`.`icon_url`, `t`.`type`, `t`.`sort` AS `titleSort`, `t`.`module_name`, `t`.`module_description`, `m`.`id` AS `menuId`, `m`.`role_type`, `m`.`sort`, `m`.`menu_url`, `m`.`description` FROM `gzh_title` `t` LEFT JOIN `gzh_menu` `m` ON `m`.parent_id = `t`.id WHERE (`t`.`status`=1) AND (`m`.`type`=1) AND (`m`.`status`=1) ORDER BY `t`.`sort` DESC, `m`.`sort` DESC
---
    public static function getMenus($isSuperSystem = 0)
    {
        $dependency = new \yii\caching\DbDependency(['sql' => 'select count(1) from '.Menu::tableName()]);
        $data = Yii::$app->cache->get(Yii::getAlias('@systemMenu'));
        if(!$data){
            $data = [];
            $query = new Query();
            $query->from(['t' => self::tableName()])->select(['t.id as title_id','t.parent_id','t.icon_url','t.type','titleSort'=>'t.sort', 't.module_name', 't.module_description','menuId'=>'m.id','m.role_type','m.sort','m.menu_url','m.description']);
            $query->leftJoin(['m' => Menu::tableName()],'{{m}}.parent_id = {{t}}.id');
            $query->where(['t.status' => 1,'m.type' => 1,'m.status' => 1]);
            $query->orderBy(['t.sort'=>SORT_DESC,'m.sort' => SORT_DESC]);
            $result = $query->all();